package usecase

var PossibleOwner = map[string][...]string{
	"1": { // Капитал
		// капитал
		"102",
		"105",
		"106",
		"107",
		"108",
		"109",
		"111",
		"114",
	},
	"2": { // Денежные средства и драгоценные металлы
		// Денежные средства
		"202",
		// Драгоценные металлы и природные драгоценные камни
		"203",
		"204",
	},
	"3": { // Межбанковские операции
		// Межбанковские расчеты
		"301",
		"302",
		"303",
		"304",
		"306",
		// Межбанковские привлеченные и размещенные средства
		"312",
		"313",
		"314",
		"315",
		"316",
		"317",
		"318",
		"319",
		"320",
		"320",
		"321",
		"322",
		"323",
		"324",
		"325",
		"329",
	},
	"4": { // Операции с клиентами
		// Средства на счетах
		"401",
		"402",
		"403",
		"404",
		"405",
		"406",
		"407",
		"408",
		"409",
		// Депозиты
		"410",
		"411",
		"412",
		"413",
		"414",
		"415",
		"416",
		"417",
		"418",
		"419",
		"420",
		"421",
		"422",
		"423",
		"425",
		"426",
		// Прочие привлеченные средства
		"427",
		"428",
		"429",
		"430",
		"431",
		"432",
		"433",
		"434",
		"435",
		"436",
		"437",
		"438",
		"439",
		"440",
		// Кредиты предоставленные
		"441",
		"442",
		"443",
		"444",
		"445",
		"446",
		"447",
		"448",
		"449",
		"450",
		"451",
		"452",
		"453",
		"454",
		"455",
		"456",
		"457",
		"458",
		// Прочие размещенные средства
		"460",
		"461",
		"462",
		"463",
		"464",
		"465",
		"466",
		"467",
		"468",
		"469",
		"470",
		"471",
		"472",
		"473",
		// Прочие активы и пассивы
		"474",
		"475",
		"476",
		"477",
		"478",
		"479",
		"496",
	},
	"5": { // Операции с ценными бумагами, производными финансовыми инструментами, цифровыми финансовыми активами
		// Вложения в долговые ценные бумаги
		"501",
		"502",
		"504",
		"505",
		// Вложения в долевые ценные бумаги
		"506",
		"507",
		"509",
		// Учтенные векселя
		"512",
		"513",
		"515",
		// Выпущенные ценные бумаги
		"520",
		"521",
		"522",
		"523",
		"524",
		"525",
		// Производные финансовые инструменты
		"526",
		"528",
		//	Субординированные облигационные займы
		"529",
		// Цифровые финансовые активы
		"531",
		"532",
		"533",
		"534",
		"535",
	},
	"6": { // Средства и имущество
		// Участие
		"601",
		"602",
		// Расчеты с дебиторами и кредиторами
		"603",
		// Основные средства
		"604",
		// Аренда
		"608",
		// Нематериальные активы
		"609",
		// Запасы
		"610",
		// Выбытие и реализация
		"612",
		// Резервы - оценочные обязательства некредитного характера
		"615",
		// Вспомогательные счета
		"616",
		"617",
		// Недвижимость, временно не используемая в основной деятельности
		"619",
		// Долгосрочные активы, предназначенные для продажи
		"620",
		// Средства труда и предметы труда, полученные по договорам отступного, залога, назначение которых не определено
		"621",
		"624",
		"625",
	},
	"7": { // Финансовые результаты
		// Финансовые результаты
		"706",
		"707",
		"708",
	},
}
